RhinoInside.Revit API Documentation
GeometryDecoder.ToPolylineCurve Method
 Converts the specified Autodesk.Revit.DB.PolyLine to an equivalent Rhino.Geometry.PolylineCurve.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Rhino.Geometry.PolylineCurve ToPolylineCurve(
	this Autodesk.Revit.DB.PolyLine polyLine
)
@staticmethod
def ToPolylineCurve(
	polyLine: Autodesk.Revit.DB.PolyLine
) -> Rhino.Geometry.PolylineCurve
Parameters
polyLine
Type: Autodesk.Revit.DB.PolyLine
Revit polyLine to convert.
Return Value
Type: Rhino.Geometry.PolylineCurve
Rhino polyLineCurve that is equivalent to the provided Revit polyLine.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.PolyLine. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToPolylineCurve(PolyLine) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
PolylineCurve rhinoPolylineCurve = revitPolyLine.ToPolylineCurve();
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
rhino_polylinecurve = revit_polyline.ToPolylineCurve() # type: RG.PolylineCurve
 Using ToPolylineCurve(PolyLine) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
PolylineCurve rhinoPolylineCurve = GeometryEncoder.ToPolylineCurve(revitPolyLine)
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryDecoder as GD
rhino_polylinecurve = GD.ToPolylineCurve(revit_polyline) # type: RG.PolylineCurve
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace